RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif.c
/*******************************************************************************
* Function Name: Cy_SMIF_CacheInvalidate
****************************************************************************//**
*
* This function is used to invalidate/clear the fast cache, the slow cache or
* both
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param cacheType
* Holds the type of the cache to be modified. \ref cy_en_smif_cache_t
*
* \return A status of function completion.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_CacheInvalidate(SMIF_Type *base, 
                                            cy_en_smif_cache_t cacheType)
{
    cy_en_smif_status_t status = CY_SMIF_SUCCESS;
    switch (cacheType)
    {
        case CY_SMIF_CACHE_SLOW:
            SMIF_SLOW_CA_CMD(base) |= SMIF_SLOW_CA_CMD_INV_Msk;
            break;
        case CY_SMIF_CACHE_FAST:
            SMIF_FAST_CA_CMD(base) |= SMIF_FAST_CA_CMD_INV_Msk;
            break;
        case CY_SMIF_CACHE_BOTH:
            SMIF_SLOW_CA_CMD(base) |= SMIF_SLOW_CA_CMD_INV_Msk;
            SMIF_FAST_CA_CMD(base) |= SMIF_FAST_CA_CMD_INV_Msk;
            break;
        default:
            /* A user error */
            status = CY_SMIF_BAD_PARAM;
            break;
    }
    return (status);
}

#if (CY_IP_MXSMIF_VERSION>=5) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_SetRxCaptureMode
****************************************************************************//**
* This function sets the Rx Capture mode setting for SMIF IP block instance
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param mode
* Rx Capture mode \ref cy_en_smif_capture_mode_t
*
* \note
* This API is available for CAT1D devices.
*******************************************************************************/
void Cy_SMIF_SetRxCaptureMode(SMIF_Type *base, cy_en_smif_capture_mode_t mode)
{
    CY_ASSERT_L1(NULL != base);

    SMIF_CTL2(base) = _VAL2FLD(SMIF_CORE_CTL2_RX_CAPTURE_MODE, (uint32_t)mode);
}

static bool Cy_SMIF_IsBridgeOn(SMIF_Base_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    return _FLD2VAL(SMIF_SMIF_BRIDGE_CTL_ENABLED, SMIF_BRIDGE_CTL(base));
}
static bool Cy_SMIF_IsRegionAddrAligned(uint32_t addr, cy_en_smif_bridge_remap_region_size_t regionSize)
{
    return (((addr & 0x1FFFFFFFU) & (~regionSize)) == 0U);
}
/*******************************************************************************
* Function Name: Cy_SMIF_Bridge_Enable
****************************************************************************//**
* This function is used to enable/disable Bridge
*
* \param base
* Holds the base address of the SMIF base registers.
*
* \param enable
* enable/disable the bridge
*
* \note
* This API is available for CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Bridge_Enable(SMIF_Base_Type *base, bool enable)
{
    CY_ASSERT_L1(NULL != base);

    uint32_t prevStatus = Cy_SysLib_EnterCriticalSection();

    /* Confirming all smif core is not busy */
    for(uint32_t smifCoreIdx = 0; smifCoreIdx < CY_SMIF_CORE_COUNT; smifCoreIdx+=1U)
    {
        if(Cy_SMIF_BusyCheck(&(base->CORE[smifCoreIdx])) == true)
        {
            return CY_SMIF_BUSY;
        }
    }

    /* Set Enable bit of the smif bridge */
    SMIF_BRIDGE_CTL(base) = _VAL2FLD(SMIF_SMIF_BRIDGE_CTL_ENABLED, (uint32_t) enable);

    Cy_SysLib_ExitCriticalSection(prevStatus);

    return CY_SMIF_SUCCESS;;
}

/*******************************************************************************
* Function Name: Cy_SMIF_Bridge_SetPortPriority
****************************************************************************//**
* This function sets the priority of PORTS (AHB/AXI)
*
* \param base
* Holds the base address of the SMIF base registers.
*
* \param bridge_priority
* priotiry configuration for different ports using AHB/AXI interface
*
* \note
* This API is available for CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Bridge_SetPortPriority(SMIF_Base_Type *base, cy_stc_smif_bridge_pri_t* bridge_priority)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != bridge_priority);

    SMIF_BRIDGE_CTL(base) = _VAL2FLD(SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AHB_SMIF0, (uint32_t) bridge_priority->pri_ahb_smif0) |
                            _VAL2FLD(SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AHB_SMIF1, (uint32_t) bridge_priority->pri_ahb_smif1) |
                            _VAL2FLD(SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AXI_SMIF0, (uint32_t) bridge_priority->pri_ahb_smif0) |
                            _VAL2FLD(SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AXI_SMIF1, (uint32_t) bridge_priority->pri_ahb_smif0);

    return CY_SMIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_SMIF_Bridge_SetSimpleRemapRegion
****************************************************************************//**
* This function sets up a new remap region.
*
* \param base
* Holds the base address of the SMIF base registers.
*
* \param region_info
* Region Information contains xip address and target remap physical addresses
* along with size of remap.
*
* \note
* This API is available for CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Bridge_SetSimpleRemapRegion(SMIF_Base_Type *base, const cy_stc_smif_bridge_remap_t* region_info)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != region_info);

    cy_en_smif_bridge_xip_space_t xipSpace = CY_EN_BRIDGE_SMIF0_XIP_SPACE;
    cy_en_smif_bridge_remap_type_t remapDest = CY_EN_BRIDGE_REMAP_TYPE_TO_SMIF0;
    cy_en_smif_status_t result = CY_SMIF_SUCCESS;

    /* Status Checking */
   if(Cy_SMIF_IsBridgeOn(base) == true)
   {
       result = CY_SMIF_BAD_PARAM;
   }
    
   /* Parameter Checking */
   if ((result == CY_SMIF_SUCCESS) ||
          (region_info->regionIdx >= CY_SMIF_BRIDGE_REMAP_REGION_COUNT) ||
          (!Cy_SMIF_IsRegionAddrAligned(region_info->xipAddr, region_info->regionSize)) ||
          (!Cy_SMIF_IsRegionAddrAligned(region_info->phyAddr, region_info->regionSize)))
   {
       result = CY_SMIF_BAD_PARAM;
   }

   /* Check the input address */ 
   if ((region_info->xipAddr & SMIF_SMIF0_XIP_MASK) == SMIF_SMIF0_XIP_ADDR)
   {
       xipSpace = CY_EN_BRIDGE_SMIF0_XIP_SPACE;
   }
   else if ((region_info->xipAddr & SMIF_SMIF1_XIP_MASK) == SMIF_SMIF1_XIP_ADDR)
   {
       xipSpace = CY_EN_BRIDGE_SMIF1_XIP_SPACE;
   }
   else
   {
       result = CY_SMIF_BAD_PARAM;
   }
    
