RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif.c
   /* Check the remap address */
   if ((region_info->phyAddr & SMIF_SMIF0_XIP_MASK) == SMIF_SMIF0_XIP_ADDR)
   {
       remapDest = CY_EN_BRIDGE_REMAP_TYPE_TO_SMIF0;
   }
   else if ((region_info->phyAddr & SMIF_SMIF1_XIP_MASK) == SMIF_SMIF1_XIP_ADDR)
   {
       remapDest = CY_EN_BRIDGE_REMAP_TYPE_TO_SMIF1;
   }
   else
   {
       result = CY_SMIF_BAD_PARAM;
   }

   if (result == CY_SMIF_SUCCESS)
   {
       SMIF_REMAPREGION_CTL(base, region_info->regionIdx) = (_VAL2FLD(SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_USE_SMIF, (uint32_t)remapDest) |
                                                            _VAL2FLD(SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_SMIF_SPACE, (uint32_t)xipSpace));
       SMIF_REMAPREGION_ADDR(base, region_info->regionIdx) = _VAL2FLD(SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_USE_SMIF, (uint32_t)region_info->xipAddr);
       SMIF_REMAPREGION_MASK(base, region_info->regionIdx) = _VAL2FLD(SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_USE_SMIF, (uint32_t)region_info->regionSize);
    
       if (remapDest == CY_EN_BRIDGE_REMAP_TYPE_TO_SMIF0)
       {
           SMIF_REMAPREGION_SMIF0_REMAP(base, region_info->regionIdx)  = region_info->phyAddr;
       }
       else
       {
           SMIF_REMAPREGION_SMIF0_REMAP(base, region_info->regionIdx) = region_info->phyAddr;
       }
   }

   return result;

}

/*******************************************************************************
* Function Name: Cy_SMIF_Bridge_SetInterleavingRemapRegion
****************************************************************************//**
* This function sets up a new interleaving remap region.
*
* \param base
* Holds the base address of the SMIF base registers.
*
* \param region_info
* Region Information contains xip address and target remap physical addresses
* on both CORES since interleaving uses both the PORTS along with size of remap.
*
* \note
* This API is available for CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Bridge_SetInterleavingRemapRegion(SMIF_Base_Type *base, const cy_stc_smif_bridge_interleave_remap_t* region_info)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != region_info);

    cy_en_smif_bridge_xip_space_t xipSpace = CY_EN_BRIDGE_SMIF0_XIP_SPACE;
    cy_en_smif_bridge_xip_space_t phy0Space = CY_EN_BRIDGE_SMIF0_XIP_SPACE;
    cy_en_smif_bridge_xip_space_t phy1Space = CY_EN_BRIDGE_SMIF0_XIP_SPACE;
    cy_en_smif_status_t result = CY_SMIF_SUCCESS;
    
     /* Status Checking */
    if(Cy_SMIF_IsBridgeOn(base) == true)
    {
        result = CY_SMIF_BAD_PARAM;
    }
     
    /* Parameter Checking */
    if ((result == CY_SMIF_SUCCESS) ||
        (region_info->regionIdx >= CY_SMIF_BRIDGE_REMAP_REGION_COUNT) ||
        (!Cy_SMIF_IsRegionAddrAligned(region_info->xipAddr, region_info->regionSize)) ||
        (!Cy_SMIF_IsRegionAddrAligned(region_info->phyAddr0, region_info->regionSize)) ||
        (!Cy_SMIF_IsRegionAddrAligned(region_info->phyAddr1, region_info->regionSize)))
    {
        result = CY_SMIF_BAD_PARAM;
    }
    
    /* Check the input address */ 
    if ((region_info->xipAddr & SMIF_SMIF0_XIP_MASK) == SMIF_SMIF0_XIP_ADDR)
    {
        xipSpace = CY_EN_BRIDGE_SMIF0_XIP_SPACE;
    }
    else if ((region_info->xipAddr & SMIF_SMIF1_XIP_MASK) == SMIF_SMIF1_XIP_ADDR)
    {
        xipSpace = CY_EN_BRIDGE_SMIF1_XIP_SPACE;
    }
    else
    {
        result = CY_SMIF_BAD_PARAM;
    }
     
    /* Check the remap address */
    if ((region_info->phyAddr0 & SMIF_SMIF0_XIP_MASK) == SMIF_SMIF0_XIP_ADDR)
    {
        phy0Space = CY_EN_BRIDGE_SMIF0_XIP_SPACE;
    }
    else if ((region_info->phyAddr0 & SMIF_SMIF1_XIP_MASK) == SMIF_SMIF1_XIP_ADDR)
    {
        phy0Space = CY_EN_BRIDGE_SMIF1_XIP_SPACE;
    }
    else
    {
        result = CY_SMIF_BAD_PARAM;
    }

    if ((region_info->phyAddr1 & SMIF_SMIF0_XIP_MASK) == SMIF_SMIF0_XIP_ADDR)
    {
        phy1Space = CY_EN_BRIDGE_SMIF0_XIP_SPACE;
    }
    else if ((region_info->phyAddr1 & SMIF_SMIF1_XIP_MASK) == SMIF_SMIF1_XIP_ADDR)
    {
        phy1Space = CY_EN_BRIDGE_SMIF1_XIP_SPACE;
    }
    else
    {
        result = CY_SMIF_BAD_PARAM;
    }

    if ((result == CY_SMIF_SUCCESS) && (phy0Space != phy1Space))
    {
        SMIF_REMAPREGION_CTL(base, region_info->regionIdx) = _VAL2FLD(SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_USE_SMIF, (uint32_t) CY_EN_BRIDGE_REMAP_TYPE_INTERLEAVE) |
                                                             _VAL2FLD(SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_SMIF_SPACE, (uint32_t)xipSpace);
        SMIF_REMAPREGION_ADDR(base, region_info->regionIdx) = _VAL2FLD(SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_ADDR_ADDR, (uint32_t)region_info->xipAddr);
        SMIF_REMAPREGION_MASK(base, region_info->regionIdx) = _VAL2FLD(SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_MASK_MASK, (uint32_t)region_info->regionSize);
         SMIF_REMAPREGION_SMIF0_REMAP(base, region_info->regionIdx)    = _VAL2FLD(SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_SMIF0_REMAP_SMIF0_REMAP, (uint32_t)region_info->phyAddr0);
        SMIF_REMAPREGION_SMIF1_REMAP(base, region_info->regionIdx) = _VAL2FLD(SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_SMIF0_REMAP_SMIF0_REMAP, (uint32_t)region_info->phyAddr1);
    }
    
    return result;
}

/*******************************************************************************
* Function Name: Cy_SMIF_Bridge_DeactivateRemapRegion
****************************************************************************//**
* This function sets up a new interleaving remap region.
*
* \param base
* Holds the base address of the SMIF base registers.
*
* \param regionIdx
* Region index for which the remap region should be deactivated.
*
* \note
* This API is available for CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Bridge_DeactivateRemapRegion(SMIF_Base_Type *base, uint32_t regionIdx)
{
    CY_ASSERT_L1(NULL != base);
    cy_en_smif_status_t result = CY_SMIF_SUCCESS;

    /* Check Bridge status and input parameters */
    if ((Cy_SMIF_IsBridgeOn(base) == true) || \
       (regionIdx >= CY_SMIF_BRIDGE_REMAP_REGION_COUNT))
    {
        result = CY_SMIF_BAD_PARAM;
    }

    if (result == CY_SMIF_SUCCESS)
    {
        SMIF_REMAPREGION_CTL(base, regionIdx)   = _VAL2FLD(SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_USE_SMIF, (uint32_t) CY_EN_BRIDGE_REMAP_TYPE_INACTIVE);
    }

    return CY_SMIF_SUCCESS;

